
//==============================================================================
// ファイル名	: result.c
// 概要			: 結果の表示・判定に必要な処理について記述したファイル。
// 最終更新日	: 2014/01/20
// 更新者		: Yanagimachi Tenshi
// Encoding		: UTF-8
//==============================================================================



/*******************************************************************************
 * 関数定義
 ******************************************************************************/
int judgment(struct World *world, int *result)
{
	/*
	戻り値は戦闘継続か否か(0 or 1)
	引数は結果を格納するための変数(誰が勝ったか、もしくは引き分けか)
	*/
}

void showResult(int result)
{
	/*
	上の関数で判定された結果を受け取って結果の発表
	終わりよければすべてよし
	この関数の面白さに全てはかかっている。
	*/
}
